app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows` FROM `patients`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'doctor'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'nurse'
---
    private function getDashboardStats()
    {
        $stats = [
            'totalPatients' => 0,
            'totalDoctors' => 0,
            'totalNurses' => 0,
            'totalAppointments' => 0,
            'pendingLabs' => 0,
            'revenue' => 0
        ];

        // Get counts based on user role
        $userRole = session()->get('role');

        if (in_array($userRole, ['admin', 'it_staff'])) {
            // Admin and IT staff can see all statistics
            $stats['totalPatients'] = $this->patientModel->countAll();
            $stats['totalDoctors'] = $this->userModel->where('role', 'doctor')->countAllResults();
            $stats['totalNurses'] = $this->userModel->where('role', 'nurse')->countAllResults();