app/Controllers/DoctorDashboardController.php

SELECT *
FROM `patients`
---
    public function patients()
    {
        // Load patient model and get all patients
        $patientModel = new \App\Models\PatientModel();

        try {
            $patients = $patientModel->findAll();