app/Controllers/PatientController.php

    public function index()
    {
        try {
            $data['patients'] = $this->patientModel->findAll();
---
SELECT *
FROM `patients`