app/Controllers/PharmacistController.php

    public function index()
    {
        $db = Database::connect();
        $batches = new MedicineBatchModel();
        $meds = new MedicineModel();
        $pres = new PrescriptionModel();

        // Total items in stock (sum of all batch quantities)
        $inStock = (int) ($batches->selectSum('stock_qty')->get()->getRow()->stock_qty ?? 0);

        // Low stock items: handle DBs without m.reorder_level by using default threshold
        $hasReorder = in_array('reorder_level', $db->getFieldNames('medicines'));
        if ($hasReorder) {
            try {
                $lowStock = $db->table('medicines m')
                    ->join('medicine_batches b', 'b.medicine_id = m.id', 'left')
                    ->select('m.id')
                    ->selectSum('b.stock_qty', 'total_stock')
                    ->groupBy('m.id')
                    ->having('COALESCE(SUM(b.stock_qty),0) <= m.reorder_level')
                    ->get()->getResult();
                $lowStockCount = is_array($lowStock) ? count($lowStock) : 0;
            } catch (\Throwable $e) {
                // Fallback to default threshold if query fails for any reason
                $defaultThreshold = 10;
                $lowStock = $db->table('medicines m')
                    ->join('medicine_batches b', 'b.medicine_id = m.id', 'left')
                    ->select('m.id')
                    ->selectSum('b.stock_qty', 'total_stock')
                    ->groupBy('m.id')
                    ->having('COALESCE(SUM(b.stock_qty),0) <=', $defaultThreshold)
                    ->get()->getResult();
---
SELECT SUM(`stock_qty`) AS `stock_qty`
FROM `medicine_batches`
SELECT `m`.`id`, SUM(`b`.`stock_qty`) AS `total_stock`
FROM `medicines` `m`
LEFT JOIN `medicine_batches` `b` ON `b`.`medicine_id` = `m`.`id`
GROUP BY `m`.`id`
HAVING COALESCE(SUM(b.stock_qty),0) <= `m`.`reorder_level`
SELECT `m`.`id`, SUM(`b`.`stock_qty`) AS `total_stock`
FROM `medicines` `m`
LEFT JOIN `medicine_batches` `b` ON `b`.`medicine_id` = `m`.`id`
GROUP BY `m`.`id`
HAVING COALESCE(SUM(b.stock_qty),0) <= 10

    public function reports()
    {
        $db = Database::connect();
        $today = date('Y-m-d');
        $week = date('Y-m-d', strtotime('-6 days'));

        $dispensedToday = (int) $db->table('dispensations')
            ->where('DATE(dispense_date)', $today)
            ->countAllResults();

        $dispensedWeek = (int) $db->table('dispensations')
            ->where('DATE(dispense_date) >=', $week)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `dispensations`
WHERE DATE(dispense_date) = '2025-08-31'
SELECT COUNT(*) AS `numrows`
FROM `dispensations`
WHERE DATE(dispense_date) >= '2025-08-25'