app/Controllers/UserManagementController.php

SELECT *
FROM `users`
---
    public function index()
    {
        if (!$this->isAllowed()) return redirect()->to('/dashboard');
        $users = $this->userModel->findAll();