app/Models/AppointmentModel.php

    public function getTodaysAppointmentsWithDetails()
    {
        return $this->select('appointments.*, users.first_name as doctor_first_name, users.last_name as doctor_last_name, patients.first_name as patient_first_name, patients.last_name as patient_last_name')
                    ->join('users', 'users.id = appointments.doctor_id')
                    ->join('patients', 'patients.id = appointments.patient_id')
                    ->where('appointment_date', date('Y-m-d'))
                    ->findAll();
---
SELECT `appointments`.*, `users`.`first_name` as `doctor_first_name`, `users`.`last_name` as `doctor_last_name`, `patients`.`first_name` as `patient_first_name`, `patients`.`last_name` as `patient_last_name`
FROM `appointments`
JOIN `users` ON `users`.`id` = `appointments`.`doctor_id`
JOIN `patients` ON `patients`.`id` = `appointments`.`patient_id`
WHERE `appointment_date` = '2025-09-11'

    public function getUpcomingAppointmentsWithDetails()
    {
        return $this->select('appointments.*, users.first_name as doctor_first_name, users.last_name as doctor_last_name, patients.first_name as patient_first_name, patients.last_name as patient_last_name')
                    ->join('users', 'users.id = appointments.doctor_id')
                    ->join('patients', 'patients.id = appointments.patient_id')
                    ->where('appointment_date >', date('Y-m-d'))
                    ->orderBy('appointment_date', 'ASC')
                    ->findAll();
---
SELECT `appointments`.*, `users`.`first_name` as `doctor_first_name`, `users`.`last_name` as `doctor_last_name`, `patients`.`first_name` as `patient_first_name`, `patients`.`last_name` as `patient_last_name`
FROM `appointments`
JOIN `users` ON `users`.`id` = `appointments`.`doctor_id`
JOIN `patients` ON `patients`.`id` = `appointments`.`patient_id`
WHERE `appointment_date` > '2025-09-11'
ORDER BY `appointment_date` ASC

    public function getCompletedAppointmentsWithDetails()
    {
        return $this->select('appointments.*, users.first_name as doctor_first_name, users.last_name as doctor_last_name, patients.first_name as patient_first_name, patients.last_name as patient_last_name')
                    ->join('users', 'users.id = appointments.doctor_id')
                    ->join('patients', 'patients.id = appointments.patient_id')
                    ->where('appointments.status', 'Completed')
                    ->findAll();
---
SELECT `appointments`.*, `users`.`first_name` as `doctor_first_name`, `users`.`last_name` as `doctor_last_name`, `patients`.`first_name` as `patient_first_name`, `patients`.`last_name` as `patient_last_name`
FROM `appointments`
JOIN `users` ON `users`.`id` = `appointments`.`doctor_id`
JOIN `patients` ON `patients`.`id` = `appointments`.`patient_id`
WHERE `appointments`.`status` = 'Completed'