app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'Pingping'
AND `status` = 'active'
 LIMIT 1
---
    public function getUserByCredentials($username, $password)
    {
        $user = $this->where('username', $username)
                     ->where('status', 'active')
                     ->first();